<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="css/main.css" type="text/css" rel="stylesheet">
<%--<script type="text/javascript" src="http://ajax.microsoft.com/ajax/jquery/jquery-1.4.min.js"></script>--%>
<script type="text/javascript" src="./js/jquery-1.4.min.js"></script>
<title>上海地区反假币上岗证书考试系统--注册</title>

<script>
$(document).ready(function(){

var subval2 = new Array();
//数组结构：一级根值,二级根值,二级显示值

subval2[0] = new Array('00095888','0009588801','上海分行            ')

subval2[1] = new Array('00095588','0009558801','上海分行            ')

subval2[2] = new Array('00095599','0009559901','上海分行            ')

subval2[3] = new Array('00095566','0009556601','上海分行            ')

subval2[4] = new Array('00095533','0009553301','上海分行            ')

subval2[5] = new Array('00095559','0009555901','上海分行            ')

subval2[6] = new Array('00095528','0009552801','上海分行            ')

subval2[7] = new Array('00096288','0009628801','上海分行            ')

subval2[8] = new Array('00095555','0009555501','上海分行            ')

subval2[9] = new Array('00095595','0009559501','上海分行            ')

subval2[10] = new Array('00095577','0009557701','上海分行            ')

subval2[11] = new Array('00095568','0009556801','上海分行            ')

subval2[12] = new Array('00095561','0009556101','上海分行            ')

subval2[13] = new Array('00095558','0009555801','上海分行            ')

subval2[14] = new Array('00095508','0009550801','上海分行            ')

subval2[15] = new Array('00095501','0009550101','上海分行            ')

subval2[16] = new Array('00096299','0009629901','上海分行            ')

subval2[17] = new Array('00011185','0001118501','上海分行            ')

subval2[18] = new Array('00095666','0009566601','上海分行            ')

subval2[19] = new Array('00095678','0009567801','上海分行            ')

subval2[20] = new Array('00095680','0009568001','上海分行            ')

subval2[21] = new Array('00095681','0009568101','上海分行            ')

subval2[22] = new Array('00095682','0009568201','上海分行            ')

subval2[23] = new Array('00095683','0009568301','上海分行            ')

subval2[24] = new Array('00095684','0009568401','上海分行            ')

subval2[25] = new Array('00095679','0009567901','上海分行            ')

subval2[26] = new Array('00095685','0009568501','上海分行            ')

subval2[27] = new Array('00096601','0009660101','上海分行            ')

subval2[28] = new Array('00096602','0009660201','上海分行            ')

subval2[29] = new Array('00096603','0009660301','上海分行            ')

subval2[30] = new Array('00096604','0009660401','上海分行            ')

subval2[31] = new Array('00096605','0009660501','上海分行            ')

subval2[32] = new Array('00096606','0009660601','上海分行            ')

subval2[33] = new Array('00096607','0009660701','上海分行            ')

subval2[34] = new Array('00096608','0009660801','上海分行            ')

subval2[35] = new Array('00096609','0009660901','上海分行            ')

subval2[36] = new Array('00096610','0009661001','上海分行            ')

subval2[37] = new Array('00096611','0009661101','上海分行            ')

subval2[38] = new Array('00096612','0009661201','上海分行            ')

subval2[39] = new Array('00096613','0009661301','上海分行            ')

subval2[40] = new Array('00096615','0009661501','上海分行            ')

subval2[41] = new Array('00096616','0009661601','上海分行            ')

subval2[42] = new Array('00096617','0009661701','上海分行            ')

subval2[43] = new Array('00096618','0009661801','上海分行            ')

subval2[44] = new Array('00096619','0009661901','上海分行            ')

subval2[45] = new Array('00096620','0009662001','上海分行            ')

subval2[46] = new Array('00096621','0009662101','上海分行            ')

subval2[47] = new Array('00096622','0009662201','上海分行            ')

subval2[48] = new Array('00096623','0009662301','上海分行            ')

subval2[49] = new Array('00096624','0009662401','上海分行            ')

subval2[50] = new Array('00096625','0009662501','上海分行            ')

subval2[51] = new Array('00096626','0009662601','上海分行            ')

subval2[52] = new Array('00096627','0009662701','上海分行            ')

subval2[53] = new Array('00096628','0009662801','上海分行            ')

subval2[54] = new Array('00096629','0009662901','上海分行            ')

subval2[55] = new Array('00096630','0009663001','上海分行            ')

subval2[56] = new Array('00096631','0009663101','上海分行            ')

subval2[57] = new Array('00096632','0009663201','上海分行            ')

subval2[58] = new Array('00096633','0009663301','上海分行            ')

subval2[59] = new Array('00096634','0009663401','上海分行            ')

subval2[60] = new Array('00096635','0009663501','上海分行            ')

subval2[61] = new Array('00096636','0009663601','上海分行            ')

subval2[62] = new Array('00096637','0009663701','上海分行            ')

subval2[63] = new Array('00096638','0009663801','上海分行            ')

subval2[64] = new Array('00096639','0009663901','上海分行            ')

subval2[65] = new Array('00096640','0009664001','上海分行            ')

subval2[66] = new Array('00096641','0009664101','上海分行            ')

subval2[67] = new Array('00096642','0009664201','上海分行            ')

subval2[68] = new Array('00096643','0009664301','上海分行            ')

subval2[69] = new Array('00096644','0009664401','上海分行            ')

subval2[70] = new Array('00096645','0009664501','上海分行            ')

subval2[71] = new Array('00096646','0009664601','上海分行            ')

subval2[72] = new Array('00096647','0009664701','上海分行            ')

subval2[73] = new Array('00096648','0009664801','上海分行            ')

subval2[74] = new Array('00096649','0009664901','上海分行            ')

subval2[75] = new Array('00096650','0009665001','上海分行            ')

subval2[76] = new Array('00962999','0096299901','上海分行            ')

subval2[77] = new Array('00962888','0096288801','上海分行            ')

subval2[78] = new Array('00095686','0009568601','上海分行            ')

subval2[79] = new Array('00096651','0009665101','上海分行            ')

subval2[80] = new Array('00096652','0009665201','上海分行            ')

subval2[81] = new Array('00095687','0009568701','上海分行            ')

subval2[82] = new Array('00095688','0009568801','上海分行            ')

subval2[83] = new Array('00096653','0009665301','上海分行            ')

subval2[84] = new Array('00096654','0009665401','上海分行            ')

subval2[85] = new Array('00095689','0009568901','上海分行            ')

subval2[86] = new Array('00095690','0009569001','上海分行            ')

subval2[87] = new Array('00095691','0009569101','上海分行            ')

subval2[88] = new Array('00095692','0009569201','上海分行            ')

subval2[89] = new Array('00095693','0009569301','上海分行            ')

subval2[90] = new Array('00095694','0009569401','上海分行            ')

subval2[91] = new Array('00095695','0009569501','上海分行            ')

subval2[92] = new Array('00095696','0009569601','上海分行            ')

subval2[93] = new Array('00096614','0009661401','上海分行            ')

subval2[94] = new Array('00096655','0009665501','上海分行            ')

subval2[95] = new Array('00095697','0009569701','上海分行            ')

subval2[96] = new Array('00096656','0009665601','上海分行            ')

subval2[97] = new Array('00096657','0009665701','上海分行            ')

subval2[98] = new Array('00095698','0009569801','上海分行            ')

subval2[99] = new Array('00095699','0009569901','上海分行            ')

subval2[100] = new Array('00095700','0009570001','上海分行            ')

subval2[101] = new Array('00095701','0009570101','上海分行            ')

subval2[102] = new Array('00096658','0009665801','上海分行            ')

subval2[103] = new Array('00096659','0009665901','上海分行            ')

subval2[104] = new Array('00095702','0009570201','上海分行            ')

subval2[105] = new Array('00095703','0009570301','上海分行            ')

subval2[106] = new Array('00096660','0009666001','上海分行            ')

subval2[107] = new Array('00096661','0009666101','上海分行            ')

subval2[108] = new Array('00095704','0009570401','上海分行            ')

subval2[109] = new Array('00095705','0009570501','上海分行            ')

subval2[110] = new Array('00095706','0009570601','上海分行            ')

subval2[111] = new Array('00096662','0009666201','上海分行            ')

subval2[112] = new Array('00096663','0009666301','上海分行            ')

subval2[113] = new Array('00096664','0009666401','上海分行            ')

subval2[114] = new Array('00095707','0009570701','上海分行            ')

subval2[115] = new Array('00095708','0009570801','上海分行            ')

subval2[116] = new Array('00095709','0009570901','上海分行            ')

var subval3 = new Array();
//数组结构：二级根值,三级根值,三级显示值

subval3[0] = new Array('0009588801','000958880101','宝山支行')

subval3[1] = new Array('0009558801','000955880101','宝山支行')

subval3[2] = new Array('0009558801','000955880102','长宁支行')

subval3[3] = new Array('0009558801','000955880103','崇明支行')

subval3[4] = new Array('0009558801','000955880104','奉贤支行')

subval3[5] = new Array('0009558801','000955880105','虹口支行')

subval3[6] = new Array('0009558801','000955880106','黄浦支行')

subval3[7] = new Array('0009558801','000955880107','嘉定支行')

subval3[8] = new Array('0009558801','000955880108','金山支行')

subval3[9] = new Array('0009558801','000955880109','静安支行')

subval3[10] = new Array('0009558801','000955880110','卢湾支行')

subval3[11] = new Array('0009558801','000955880111','闵行支行')

subval3[12] = new Array('0009558801','000955880112','南汇支行')

subval3[13] = new Array('0009558801','000955880113','浦东分行')

subval3[14] = new Array('0009558801','000955880114','普陀支行')

subval3[15] = new Array('0009558801','000955880115','青浦支行')

subval3[16] = new Array('0009558801','000955880116','松江支行')

subval3[17] = new Array('0009558801','000955880117','徐汇支行')

subval3[18] = new Array('0009558801','000955880118','杨浦支行')

subval3[19] = new Array('0009558801','000955880119','闸北支行')

subval3[20] = new Array('0009559901','000955990101','宝山支行')

subval3[21] = new Array('0009559901','000955990102','长宁支行')

subval3[22] = new Array('0009559901','000955990103','崇明支行')

subval3[23] = new Array('0009559901','000955990104','奉贤支行')

subval3[24] = new Array('0009559901','000955990105','虹口支行')

subval3[25] = new Array('0009559901','000955990106','黄浦支行')

subval3[26] = new Array('0009559901','000955990107','嘉定支行')

subval3[27] = new Array('0009559901','000955990108','金山支行')

subval3[28] = new Array('0009559901','000955990109','静安支行')

subval3[29] = new Array('0009559901','000955990110','卢湾支行')

subval3[30] = new Array('0009559901','000955990111','闵行支行')

subval3[31] = new Array('0009559901','000955990112','南汇支行')

subval3[32] = new Array('0009559901','000955990113','浦东分行')

subval3[33] = new Array('0009559901','000955990114','普陀支行')

subval3[34] = new Array('0009559901','000955990115','青浦支行')

subval3[35] = new Array('0009559901','000955990116','松江支行')

subval3[36] = new Array('0009559901','000955990117','徐汇支行')

subval3[37] = new Array('0009559901','000955990118','五角场支行')

subval3[38] = new Array('0009559901','000955990119','闸北支行')

subval3[39] = new Array('0009556601','000955660101','宝山支行')

subval3[40] = new Array('0009556601','000955660102','长宁支行')

subval3[41] = new Array('0009556601','000955660103','分行营业部')

subval3[42] = new Array('0009556601','000955660104','奉贤支行')

subval3[43] = new Array('0009556601','000955660105','虹口支行')

subval3[44] = new Array('0009556601','000955660106','黄浦支行')

subval3[45] = new Array('0009556601','000955660107','嘉定支行')

subval3[46] = new Array('0009556601','000955660108','金山支行')

subval3[47] = new Array('0009556601','000955660109','静安支行')

subval3[48] = new Array('0009556601','000955660110','卢湾支行')

subval3[49] = new Array('0009556601','000955660111','闵行支行')

subval3[50] = new Array('0009556601','000955660112','南汇支行')

subval3[51] = new Array('0009556601','000955660113','浦东分行')

subval3[52] = new Array('0009556601','000955660114','普陀支行')

subval3[53] = new Array('0009556601','000955660115','青浦支行')

subval3[54] = new Array('0009556601','000955660116','松江支行')

subval3[55] = new Array('0009556601','000955660117','徐汇支行')

subval3[56] = new Array('0009556601','000955660118','杨浦支行')

subval3[57] = new Array('0009556601','000955660119','闸北支行')

subval3[58] = new Array('0009553301','000955330101','宝钢宝山支行')

subval3[59] = new Array('0009553301','000955330102','长宁支行')

subval3[60] = new Array('0009553301','000955330103','崇明支行')

subval3[61] = new Array('0009553301','000955330104','奉贤支行')

subval3[62] = new Array('0009553301','000955330105','虹口支行')

subval3[63] = new Array('0009553301','000955330106','黄浦支行')

subval3[64] = new Array('0009553301','000955330107','嘉定支行')

subval3[65] = new Array('0009553301','000955330108','金山石化支行')

subval3[66] = new Array('0009553301','000955330109','静安支行')

subval3[67] = new Array('0009553301','000955330110','卢湾支行')

subval3[68] = new Array('0009553301','000955330111','闵行支行')

subval3[69] = new Array('0009553301','000955330112','南汇支行')

subval3[70] = new Array('0009553301','000955330113','浦东分行')

subval3[71] = new Array('0009553301','000955330114','普陀支行')

subval3[72] = new Array('0009553301','000955330115','青浦支行')

subval3[73] = new Array('0009553301','000955330116','松江支行')

subval3[74] = new Array('0009553301','000955330117','徐汇支行')

subval3[75] = new Array('0009553301','000955330118','杨浦支行')

subval3[76] = new Array('0009553301','000955330119','闸北支行')

subval3[77] = new Array('0009555901','000955590101','宝山支行')

subval3[78] = new Array('0009555901','000955590102','长宁支行')

subval3[79] = new Array('0009555901','000955590103','分行营业部')

subval3[80] = new Array('0009555901','000955590104','奉贤支行')

subval3[81] = new Array('0009555901','000955590105','虹口支行')

subval3[82] = new Array('0009555901','000955590106','现金储运中心')

subval3[83] = new Array('0009555901','000955590107','嘉定支行')

subval3[84] = new Array('0009555901','000955590108','松江支行')

subval3[85] = new Array('0009555901','000955590109','临港支行')

subval3[86] = new Array('0009555901','000955590110','新区支行')

subval3[87] = new Array('0009555901','000955590111','闵行支行')

subval3[88] = new Array('0009555901','000955590112','市西支行')

subval3[89] = new Array('0009555901','000955590113','浦东分行')

subval3[90] = new Array('0009555901','000955590114','张江支行')

subval3[91] = new Array('0009555901','000955590115','青浦支行')

subval3[92] = new Array('0009555901','000955590116','闸北支行')

subval3[93] = new Array('0009555901','000955590117','徐汇支行')

subval3[94] = new Array('0009555901','000955590118','杨浦支行')

subval3[95] = new Array('0009555901','000955590119','其他')

subval3[96] = new Array('0009552801','000955280101','宝山支行')

subval3[97] = new Array('0009552801','000955280102','长宁支行')

subval3[98] = new Array('0009552801','000955280103','崇明支行')

subval3[99] = new Array('0009552801','000955280104','奉贤支行')

subval3[100] = new Array('0009552801','000955280105','虹口支行')

subval3[101] = new Array('0009552801','000955280106','黄浦支行')

subval3[102] = new Array('0009552801','000955280107','嘉定支行')

subval3[103] = new Array('0009552801','000955280108','金山支行')

subval3[104] = new Array('0009552801','000955280109','静安支行')

subval3[105] = new Array('0009552801','000955280110','卢湾支行')

subval3[106] = new Array('0009552801','000955280111','闵行支行')

subval3[107] = new Array('0009552801','000955280112','南汇支行')

subval3[108] = new Array('0009552801','000955280113','龙阳支行')

subval3[109] = new Array('0009552801','000955280114','普陀支行')

subval3[110] = new Array('0009552801','000955280115','青浦支行')

subval3[111] = new Array('0009552801','000955280116','松江支行')

subval3[112] = new Array('0009552801','000955280117','徐汇支行')

subval3[113] = new Array('0009552801','000955280118','杨浦支行')

subval3[114] = new Array('0009552801','000955280119','闸北支行')

subval3[115] = new Array('0009628801','000962880101','宝山支行')

subval3[116] = new Array('0009628801','000962880102','长宁支行')

subval3[117] = new Array('0009628801','000962880103','崇明支行')

subval3[118] = new Array('0009628801','000962880104','奉贤支行')

subval3[119] = new Array('0009628801','000962880105','虹口支行')

subval3[120] = new Array('0009628801','000962880106','黄浦支行')

subval3[121] = new Array('0009628801','000962880107','嘉定支行')

subval3[122] = new Array('0009628801','000962880108','金山支行')

subval3[123] = new Array('0009628801','000962880109','静安支行')

subval3[124] = new Array('0009628801','000962880110','卢湾支行')

subval3[125] = new Array('0009628801','000962880111','闵行支行')

subval3[126] = new Array('0009628801','000962880112','南汇支行')

subval3[127] = new Array('0009628801','000962880113','浦东支行')

subval3[128] = new Array('0009628801','000962880114','普陀支行')

subval3[129] = new Array('0009628801','000962880115','青浦支行')

subval3[130] = new Array('0009628801','000962880116','松江支行')

subval3[131] = new Array('0009628801','000962880117','徐汇支行')

subval3[132] = new Array('0009628801','000962880118','杨浦支行')

subval3[133] = new Array('0009628801','000962880119','闸北支行')

subval3[134] = new Array('0009555501','000955550101','外滩支行')

subval3[135] = new Array('0009555501','000955550102','张杨支行')

subval3[136] = new Array('0009555501','000955550103','南西支行')

subval3[137] = new Array('0009555501','000955550104','新客站支行')

subval3[138] = new Array('0009555501','000955550105','泰兴支行')

subval3[139] = new Array('0009555501','000955550106','淮海支行')

subval3[140] = new Array('0009555501','000955550107','江宁支行')

subval3[141] = new Array('0009555501','000955550108','淮中支行')

subval3[142] = new Array('0009555501','000955550109','长宁支行')

subval3[143] = new Array('0009555501','000955550110','长乐支行')

subval3[144] = new Array('0009555501','000955550111','东大名支行')

subval3[145] = new Array('0009555501','000955550112','闵行支行')

subval3[146] = new Array('0009555501','000955550113','高安支行')

subval3[147] = new Array('0009555501','000955550114','徐家汇支行')

subval3[148] = new Array('0009555501','000955550115','福州路支行')

subval3[149] = new Array('0009555501','000955550116','东方支行')

subval3[150] = new Array('0009555501','000955550117','新外滩支行')

subval3[151] = new Array('0009555501','000955550118','源深支行')

subval3[152] = new Array('0009555501','000955550119','豫园支行')

subval3[153] = new Array('0009559501','000955950101','宝山支行')

subval3[154] = new Array('0009559501','000955950102','长宁支行')

subval3[155] = new Array('0009559501','000955950103','分行营业部')

subval3[156] = new Array('0009559501','000955950104','淮海支行')

subval3[157] = new Array('0009559501','000955950105','虹口支行')

subval3[158] = new Array('0009559501','000955950106','黄浦支行')

subval3[159] = new Array('0009559501','000955950107','嘉定支行')

subval3[160] = new Array('0009559501','000955950108','金山支行')

subval3[161] = new Array('0009559501','000955950109','静安支行')

subval3[162] = new Array('0009559501','000955950110','卢湾支行')

subval3[163] = new Array('0009559501','000955950111','闵行支行')

subval3[164] = new Array('0009559501','000955950112','普陀支行')

subval3[165] = new Array('0009559501','000955950113','浦东支行')

subval3[166] = new Array('0009559501','000955950114','真新支行')

subval3[167] = new Array('0009559501','000955950115','青浦支行')

subval3[168] = new Array('0009559501','000955950116','松江支行')

subval3[169] = new Array('0009559501','000955950117','徐汇支行')

subval3[170] = new Array('0009559501','000955950118','杨浦支行')

subval3[171] = new Array('0009559501','000955950119','闸北支行')

subval3[172] = new Array('0009557701','000955770101','宝山支行')

subval3[173] = new Array('0009557701','000955770102','长宁支行')

subval3[174] = new Array('0009557701','000955770103','奉贤支行')

subval3[175] = new Array('0009557701','000955770104','外滩支行')

subval3[176] = new Array('0009557701','000955770105','虹口支行')

subval3[177] = new Array('0009557701','000955770106','黄浦支行')

subval3[178] = new Array('0009557701','000955770107','嘉定支行')

subval3[179] = new Array('0009557701','000955770108','临港支行')

subval3[180] = new Array('0009557701','000955770109','静安支行')

subval3[181] = new Array('0009557701','000955770110','卢湾支行')

subval3[182] = new Array('0009557701','000955770111','闵行支行')

subval3[183] = new Array('0009557701','000955770112','南汇支行')

subval3[184] = new Array('0009557701','000955770113','浦东支行')

subval3[185] = new Array('0009557701','000955770114','普陀支行')

subval3[186] = new Array('0009557701','000955770115','虹桥支行')

subval3[187] = new Array('0009557701','000955770116','外高桥支行')

subval3[188] = new Array('0009557701','000955770117','徐汇支行')

subval3[189] = new Array('0009557701','000955770118','杨浦支行')

subval3[190] = new Array('0009557701','000955770119','闸北支行')

subval3[191] = new Array('0009556801','000955680101','宝山支行')

subval3[192] = new Array('0009556801','000955680102','长宁支行')

subval3[193] = new Array('0009556801','000955680103','西南支行')

subval3[194] = new Array('0009556801','000955680104','外滩支行')

subval3[195] = new Array('0009556801','000955680105','虹口支行')

subval3[196] = new Array('0009556801','000955680106','黄浦支行')

subval3[197] = new Array('0009556801','000955680107','嘉定支行')

subval3[198] = new Array('0009556801','000955680108','分行营业部')

subval3[199] = new Array('0009556801','000955680109','静安支行')

subval3[200] = new Array('0009556801','000955680110','卢湾支行')

subval3[201] = new Array('0009556801','000955680111','闵行支行')

subval3[202] = new Array('0009556801','000955680112','期交所支行')

subval3[203] = new Array('0009556801','000955680113','浦东支行')

subval3[204] = new Array('0009556801','000955680114','普陀支行')

subval3[205] = new Array('0009556801','000955680115','青浦支行')

subval3[206] = new Array('0009556801','000955680116','松江支行')

subval3[207] = new Array('0009556801','000955680117','徐汇支行')

subval3[208] = new Array('0009556801','000955680118','杨浦支行')

subval3[209] = new Array('0009556801','000955680119','广场支行')

subval3[210] = new Array('0009556101','000955610101','宝山支行')

subval3[211] = new Array('0009556101','000955610102','长宁支行')

subval3[212] = new Array('0009556101','000955610103','华山支行')

subval3[213] = new Array('0009556101','000955610104','奉贤支行')

subval3[214] = new Array('0009556101','000955610105','虹口支行')

subval3[215] = new Array('0009556101','000955610106','黄浦支行')

subval3[216] = new Array('0009556101','000955610107','嘉定支行')

subval3[217] = new Array('0009556101','000955610108','武宁支行')

subval3[218] = new Array('0009556101','000955610109','静安支行')

subval3[219] = new Array('0009556101','000955610110','卢湾支行')

subval3[220] = new Array('0009556101','000955610111','闵行支行')

subval3[221] = new Array('0009556101','000955610112','南汇支行')

subval3[222] = new Array('0009556101','000955610113','浦东支行')

subval3[223] = new Array('0009556101','000955610114','普陀支行')

subval3[224] = new Array('0009556101','000955610115','青浦支行')

subval3[225] = new Array('0009556101','000955610116','松江支行')

subval3[226] = new Array('0009556101','000955610117','徐汇支行')

subval3[227] = new Array('0009556101','000955610118','杨浦支行')

subval3[228] = new Array('0009556101','000955610119','闸北支行')

subval3[229] = new Array('0009555801','000955580101','宝钢宝山支行')

subval3[230] = new Array('0009555801','000955580102','长宁支行')

subval3[231] = new Array('0009555801','000955580103','中环支行')

subval3[232] = new Array('0009555801','000955580104','奉贤支行')

subval3[233] = new Array('0009555801','000955580105','虹口支行')

subval3[234] = new Array('0009555801','000955580106','黄浦支行')

subval3[235] = new Array('0009555801','000955580107','嘉定支行')

subval3[236] = new Array('0009555801','000955580108','联洋支行')

subval3[237] = new Array('0009555801','000955580109','静安支行')

subval3[238] = new Array('0009555801','000955580110','卢湾支行')

subval3[239] = new Array('0009555801','000955580111','闵行支行')

subval3[240] = new Array('0009555801','000955580112','南汇支行')

subval3[241] = new Array('0009555801','000955580113','浦东分行')

subval3[242] = new Array('0009555801','000955580114','普陀支行')

subval3[243] = new Array('0009555801','000955580115','青浦支行')

subval3[244] = new Array('0009555801','000955580116','松江支行')

subval3[245] = new Array('0009555801','000955580117','徐汇支行')

subval3[246] = new Array('0009555801','000955580118','四平路支行')

subval3[247] = new Array('0009555801','000955580119','闸北支行')

subval3[248] = new Array('0009550801','000955080101','宝山支行')

subval3[249] = new Array('0009550801','000955080102','长宁支行')

subval3[250] = new Array('0009550801','000955080103','分行营业部')

subval3[251] = new Array('0009550801','000955080104','虹桥支行')

subval3[252] = new Array('0009550801','000955080105','虹口支行')

subval3[253] = new Array('0009550801','000955080106','黄浦支行')

subval3[254] = new Array('0009550801','000955080107','嘉定支行')

subval3[255] = new Array('0009550801','000955080108','金山支行')

subval3[256] = new Array('0009550801','000955080109','静安支行')

subval3[257] = new Array('0009550801','000955080110','延安支行')

subval3[258] = new Array('0009550801','000955080111','闵行支行')

subval3[259] = new Array('0009550801','000955080112','南汇支行')

subval3[260] = new Array('0009550801','000955080113','浦东支行')

subval3[261] = new Array('0009550801','000955080114','普陀支行')

subval3[262] = new Array('0009550801','000955080115','青浦支行')

subval3[263] = new Array('0009550801','000955080116','松江支行')

subval3[264] = new Array('0009550801','000955080117','徐汇支行')

subval3[265] = new Array('0009550801','000955080118','大柏树支行')

subval3[266] = new Array('0009550801','000955080119','闸北支行')

subval3[267] = new Array('0009550101','000955010101','宝山支行')

subval3[268] = new Array('0009550101','000955010102','长宁支行')

subval3[269] = new Array('0009550101','000955010103','外滩支行')

subval3[270] = new Array('0009550101','000955010104','奉贤支行')

subval3[271] = new Array('0009550101','000955010105','虹口支行')

subval3[272] = new Array('0009550101','000955010106','黄浦支行')

subval3[273] = new Array('0009550101','000955010107','嘉定支行')

subval3[274] = new Array('0009550101','000955010108','金桥支行')

subval3[275] = new Array('0009550101','000955010109','静安支行')

subval3[276] = new Array('0009550101','000955010110','卢湾支行')

subval3[277] = new Array('0009550101','000955010111','闵行支行')

subval3[278] = new Array('0009550101','000955010112','南汇支行')

subval3[279] = new Array('0009550101','000955010113','陆家嘴支行')

subval3[280] = new Array('0009550101','000955010114','普陀支行')

subval3[281] = new Array('0009550101','000955010115','青浦支行')

subval3[282] = new Array('0009550101','000955010116','松江支行')

subval3[283] = new Array('0009550101','000955010117','徐汇支行')

subval3[284] = new Array('0009550101','000955010118','杨浦支行')

subval3[285] = new Array('0009550101','000955010119','闸北支行')

subval3[286] = new Array('0096299901','009629990101','宝山支行')

subval3[287] = new Array('0009629901','000962990102','长宁支行')

subval3[288] = new Array('0009629901','000962990103','崇明支行')

subval3[289] = new Array('0009629901','000962990104','奉贤支行')

subval3[290] = new Array('0009629901','000962990105','虹口支行')

subval3[291] = new Array('0009629901','000962990106','黄浦支行')

subval3[292] = new Array('0009629901','000962990107','嘉定支行')

subval3[293] = new Array('0009629901','000962990108','金山支行')

subval3[294] = new Array('0009629901','000962990109','静安支行')

subval3[295] = new Array('0009629901','000962990110','卢湾支行')

subval3[296] = new Array('0009629901','000962990111','闵行支行')

subval3[297] = new Array('0009629901','000962990112','南汇支行')

subval3[298] = new Array('0009629901','000962990113','浦东支行')

subval3[299] = new Array('0009629901','000962990114','普陀支行')

subval3[300] = new Array('0009629901','000962990115','青浦支行')

subval3[301] = new Array('0009629901','000962990116','松江支行')

subval3[302] = new Array('0009629901','000962990117','徐汇支行')

subval3[303] = new Array('0009629901','000962990118','杨浦支行')

subval3[304] = new Array('0009629901','000962990119','闸北支行')

subval3[305] = new Array('0001118501','000111850101','邮储银行静安支行')

subval3[306] = new Array('0001118501','000111850102','邮储银行闸北支行')

subval3[307] = new Array('0001118501','000111850103','邮储银行徐汇支行')

subval3[308] = new Array('0001118501','000111850104','邮储银行闵行支行')

subval3[309] = new Array('0001118501','000111850105','邮储银行嘉定支行')

subval3[310] = new Array('0001118501','000111850106','邮储银行浦东支行')

subval3[311] = new Array('0001118501','000111850107','邮储银行南汇支行')

subval3[312] = new Array('0001118501','000111850108','邮储银行奉贤支行')

subval3[313] = new Array('0001118501','000111850109','邮储银行松江支行')

subval3[314] = new Array('0001118501','000111850110','邮储银行金山支行')

subval3[315] = new Array('0001118501','000111850111','邮储银行青浦支行')

subval3[316] = new Array('0001118501','000111850112','邮储银行宝山支行')

subval3[317] = new Array('0001118501','000111850113','邮储银行川沙支行')

subval3[318] = new Array('0001118501','000111850114','邮储银行崇明支行')

subval3[319] = new Array('0001118501','000111850115','邮储银行其他支行')

subval3[320] = new Array('0001118501','000111850116','邮政公司市西支局')

subval3[321] = new Array('0001118501','000111850117','邮政公司市北支局')

subval3[322] = new Array('0001118501','000111850118','邮政公司市南支局')

subval3[323] = new Array('0001118501','000111850119','邮政公司闵行支局')

subval3[324] = new Array('0009566601','000956660101','分行营业部')

subval3[325] = new Array('0009566601','000956660102','宝山支行')

subval3[326] = new Array('0009566601','000956660103','崇明支行')

subval3[327] = new Array('0009566601','000956660104','奉贤支行')

subval3[328] = new Array('0009566601','000956660105','嘉定支行')

subval3[329] = new Array('0009566601','000956660106','金山支行')

subval3[330] = new Array('0009566601','000956660107','闵行支行')

subval3[331] = new Array('0009566601','000956660108','浦东分行')

subval3[332] = new Array('0009566601','000956660109','青浦支行')

subval3[333] = new Array('0009566601','000956660110','松江支行')

subval3[334] = new Array('0009566601','000956660111','南汇支行')

subval3[335] = new Array('0009566601','000956660112','其他')

subval3[336] = new Array('0009567801','000956780101','宝山支行')

subval3[337] = new Array('0009567801','000956780102','长宁支行')

subval3[338] = new Array('0009567801','000956780103','崇明支行')

subval3[339] = new Array('0009567801','000956780104','奉贤支行')

subval3[340] = new Array('0009567801','000956780105','虹口支行')

subval3[341] = new Array('0009567801','000956780106','黄浦支行')

subval3[342] = new Array('0009567801','000956780107','嘉定支行')

subval3[343] = new Array('0009567801','000956780108','金山支行')

subval3[344] = new Array('0009567801','000956780109','静安支行')

subval3[345] = new Array('0009567801','000956780110','卢湾支行')

subval3[346] = new Array('0009567801','000956780111','闵行支行')

subval3[347] = new Array('0009567801','000956780112','南汇支行')

subval3[348] = new Array('0009567801','000956780113','浦东支行')

subval3[349] = new Array('0009567801','000956780114','普陀支行')

subval3[350] = new Array('0009567801','000956780115','青浦支行')

subval3[351] = new Array('0009567801','000956780116','松江支行')

subval3[352] = new Array('0009567801','000956780117','徐汇支行')

subval3[353] = new Array('0009567801','000956780118','杨浦支行')

subval3[354] = new Array('0009567801','000956780119','闸北支行')

subval3[355] = new Array('0009588801','000958880102','长宁支行')

subval3[356] = new Array('0009588801','000958880103','崇明支行')

subval3[357] = new Array('0009588801','000958880104','奉贤支行')

subval3[358] = new Array('0009588801','000958880105','虹口支行')

subval3[359] = new Array('0009588801','000958880106','黄浦支行')

subval3[360] = new Array('0009588801','000958880107','嘉定支行')

subval3[361] = new Array('0009588801','000958880108','金山支行')

subval3[362] = new Array('0009588801','000958880109','静安支行')

subval3[363] = new Array('0009588801','000958880110','卢湾支行')

subval3[364] = new Array('0009588801','000958880111','闵行支行')

subval3[365] = new Array('0009588801','000958880112','南汇支行')

subval3[366] = new Array('0009588801','000958880113','浦东支行')

subval3[367] = new Array('0009588801','000958880114','普陀支行')

subval3[368] = new Array('0009588801','000958880115','青浦支行')

subval3[369] = new Array('0009588801','000958880116','松江支行')

subval3[370] = new Array('0009588801','000958880117','徐汇支行')

subval3[371] = new Array('0009588801','000958880118','杨浦支行')

subval3[372] = new Array('0009588801','000958880119','闸北支行')

subval3[373] = new Array('0001118501','000111850120','邮政公司嘉定支局')

subval3[374] = new Array('0009550101','000955010120','其他')

subval3[375] = new Array('0009550801','000955080120','其他')

subval3[376] = new Array('0009552801','000955280120','三林支行')

subval3[377] = new Array('0009553301','000955330120','其他')

subval3[378] = new Array('0009555501','000955550120','新天地支行')

subval3[379] = new Array('0009555801','000955580120','其他')

subval3[380] = new Array('0009556101','000955610120','其他')

subval3[381] = new Array('0009556601','000955660120','浦东开发区支行')

subval3[382] = new Array('0009556801','000955680120','其他')

subval3[383] = new Array('0009557701','000955770120','其他')

subval3[384] = new Array('0009558801','000955880120','浦东开发区支行')

subval3[385] = new Array('0009559501','000955950120','其他')

subval3[386] = new Array('0009559901','000955990120','金桥支行')

subval3[387] = new Array('0009567801','000956780120','支行需重填')

subval3[388] = new Array('0009588801','000958880120','支行需重填')

subval3[389] = new Array('0096288801','009628880120','总行营业部')

subval3[390] = new Array('0096299901','009629990120','总行营业部')

subval3[391] = new Array('0009552801','000955280121','现金处理中心')

subval3[392] = new Array('0009552801','000955280122','第一营业部')

subval3[393] = new Array('0009552801','000955280123','分行营业部')

subval3[394] = new Array('0009552801','000955280124','金桥支行')

subval3[395] = new Array('0009552801','000955280125','空港支行')

subval3[396] = new Array('0009552801','000955280126','陆家嘴支行')

subval3[397] = new Array('0009552801','000955280127','外高桥支行')

subval3[398] = new Array('0009567801','000956780121','法国巴黎银行')

subval3[399] = new Array('0009567801','000956780122','德富泰银行')

subval3[400] = new Array('0009567801','000956780123','华一银行')

subval3[401] = new Array('0009567801','000956780124','汇丰银行')

subval3[402] = new Array('0009567801','000956780125','渣打银行')

subval3[403] = new Array('0009567801','000956780126','意大利罗马银行')

subval3[404] = new Array('0009567801','000956780127','新加坡大华银行')

subval3[405] = new Array('0009567801','000956780128','新加坡华侨银行')

subval3[406] = new Array('0009567801','000956780129','新加坡星展银行')

subval3[407] = new Array('0009567801','000956780130','恒生银行')

subval3[408] = new Array('0009567801','000956780131','东亚银行')

subval3[409] = new Array('0009567801','000956780132','东京三菱日联银行')

subval3[410] = new Array('0009567801','000956780133','日本瑞穗银行')

subval3[411] = new Array('0009567801','000956780134','日本三井住友银行')

subval3[412] = new Array('0009567801','000956780135','花旗银行')

subval3[413] = new Array('0009567801','000956780136','荷兰银行')

subval3[414] = new Array('0009567801','000956780137','平安银行')

subval3[415] = new Array('0009553301','000955330121','分行营业部')

subval3[416] = new Array('0009553301','000955330122','现金调运中心')

subval3[417] = new Array('0009568301','000956830101','杨浦支行')

subval3[418] = new Array('0009568301','000956830102','浦东支行')

subval3[419] = new Array('0009568301','000956830103','长宁支行')

subval3[420] = new Array('0009568301','000956830104','淮海支行')

subval3[421] = new Array('0009568301','000956830105','分行营业部')

subval3[422] = new Array('0009568101','000956810101','分行营业部')

subval3[423] = new Array('0009568201','000956820101','分行营业部')

subval3[424] = new Array('0009568001','000956800101','分行营业部')

subval3[425] = new Array('0009555501','000955550121','延西支行')

subval3[426] = new Array('0009555501','000955550122','广场支行')

subval3[427] = new Array('0009555501','000955550123','中远两湾城支行')

subval3[428] = new Array('0009555501','000955550124','张江支行')

subval3[429] = new Array('0009555501','000955550125','虹桥支行')

subval3[430] = new Array('0009555501','000955550126','长阳支行')

subval3[431] = new Array('0009555501','000955550127','四平支行')

subval3[432] = new Array('0009555501','000955550128','宝山支行')

subval3[433] = new Array('0009555501','000955550129','五角场支行')

subval3[434] = new Array('0009555501','000955550130','静安寺支行')

subval3[435] = new Array('0009555501','000955550131','曹杨支行')

subval3[436] = new Array('0009555501','000955550132','闻喜支行')

subval3[437] = new Array('0009555501','000955550133','江湾支行')

subval3[438] = new Array('0009555501','000955550134','天山支行')

subval3[439] = new Array('0009555501','000955550135','曹家渡支行')

subval3[440] = new Array('0009555501','000955550136','古北支行')

subval3[441] = new Array('0009555501','000955550137','世纪大道支行')

subval3[442] = new Array('0009555501','000955550138','延东支行')

subval3[443] = new Array('0009559901','000955990121','川沙支行')

subval3[444] = new Array('0009555501','000955550139','虹口体育场支行')

subval3[445] = new Array('0009555501','000955550140','川北支行')

subval3[446] = new Array('0009555501','000955550141','联洋支行')

subval3[447] = new Array('0009555501','000955550142','田林支行')

subval3[448] = new Array('0009555501','000955550143','金陵支行')

subval3[449] = new Array('0009555501','000955550144','浦东大道支行')

subval3[450] = new Array('0009555501','000955550145','分行营业部')

subval3[451] = new Array('0009555501','000955550146','华灵支行')

subval3[452] = new Array('0009555501','000955550147','金桥支行')

subval3[453] = new Array('0009555501','000955550148','民生支行')

subval3[454] = new Array('0009555501','000955550149','嘉定支行')

subval3[455] = new Array('0009555501','000955550150','松江支行')

subval3[456] = new Array('0009555501','000955550151','中山支行')

subval3[457] = new Array('0009555501','000955550152','丽园支行')

subval3[458] = new Array('0009555501','000955550153','天目支行')

subval3[459] = new Array('0009555501','000955550154','外高桥支行')

subval3[460] = new Array('0009555501','000955550155','大木桥支行')

subval3[461] = new Array('0009555501','000955550156','天钥桥支行')

subval3[462] = new Array('0009555501','000955550157','其他')

subval3[463] = new Array('0009555801','000955580121','北京西路支行')

subval3[464] = new Array('0009555801','000955580122','漕河泾支行')

subval3[465] = new Array('0009555801','000955580123','分行营业部')

subval3[466] = new Array('0009555801','000955580124','富丽大厦支行')

subval3[467] = new Array('0009555801','000955580125','淮海路支行')

subval3[468] = new Array('0009555801','000955580126','市中支行')

subval3[469] = new Array('0009555801','000955580127','外滩支行')

subval3[470] = new Array('0009555801','000955580128','五角场支行')

subval3[471] = new Array('0009555801','000955580129','五牛城支行')

subval3[472] = new Array('0009555801','000955580130','沪西支行')

subval3[473] = new Array('0009555801','000955580131','张江支行')

subval3[474] = new Array('0009555801','000955580132','中信泰富广场支行')

subval3[475] = new Array('0009568401','000956840101','分行营业部')

subval3[476] = new Array('0009555801','000955580133','虹桥支行')

subval3[477] = new Array('0009567801','000956780138','大新银行')

subval3[478] = new Array('0009567801','000956780139','德国商业银行')

subval3[479] = new Array('0009567801','000956780140','德意志银行')

subval3[480] = new Array('0009567801','000956780141','法国东方汇理银行')

subval3[481] = new Array('0009567801','000956780142','法国外贸银行')

subval3[482] = new Array('0009567801','000956780143','韩亚银行')

subval3[483] = new Array('0009567801','000956780144','华侨银行')

subval3[484] = new Array('0009567801','000956780145','联合银行')

subval3[485] = new Array('0009567801','000956780146','新韩银行')

subval3[486] = new Array('0009567801','000956780147','意大利西雅那银行')

subval3[487] = new Array('0096288801','009628880121','白玉支行')

subval3[488] = new Array('0009567801','000956780148','比利时富通银行')

subval3[489] = new Array('0009556801','000955680121','滨江支行')

subval3[490] = new Array('0096288801','009628880122','漕河泾支行')

subval3[491] = new Array('0009559901','000955990122','分行营业部')

subval3[492] = new Array('0009556601','000955660121','中银支行')

subval3[493] = new Array('0096288801','009628880123','福民支行')

subval3[494] = new Array('0009567801','000956780149','韩国外换银行')

subval3[495] = new Array('0009556801','000955680122','虹桥支行')

subval3[496] = new Array('0009559901','000955990123','其他')

subval3[497] = new Array('0009556801','000955680123','丽园支行')

subval3[498] = new Array('0009556801','000955680124','陆家嘴支行')

subval3[499] = new Array('0009567801','000956780150','美国银行')

subval3[500] = new Array('0009550101','000955010121','南京西路支行')

subval3[501] = new Array('0009567801','000956780151','南洋商业银行')

subval3[502] = new Array('0009567801','000956780152','盘古银行')

subval3[503] = new Array('0009556601','000955660122','其他')

subval3[504] = new Array('0096288801','009628880124','信用卡中心')

subval3[505] = new Array('0009556801','000955680125','市南支行')

subval3[506] = new Array('0009556801','000955680126','市西支行')

subval3[507] = new Array('0009556801','000955680127','外高桥支行')

subval3[508] = new Array('0096288801','009628880125','其他')

subval3[509] = new Array('0009550801','000955080121','常熟路支行')

subval3[510] = new Array('0009567801','000956780153','永亨银行')

subval3[511] = new Array('0009567801','000956780154','友利银行')

subval3[512] = new Array('0096299901','009629990121','滨江支行')

subval3[513] = new Array('0009550101','000955010122','市西支行')

subval3[514] = new Array('0009567901','000956790101','分行营业部')

subval3[515] = new Array('0009567901','000956790102','张江支行')

subval3[516] = new Array('0009567901','000956790103','黄浦支行')

subval3[517] = new Array('0009567901','000956790104','外滩支行')

subval3[518] = new Array('0009567901','000956790105','新天地支行')

subval3[519] = new Array('0009567901','000956790106','徐家汇支行')

subval3[520] = new Array('0009568501','000956850101','分行营业部')

subval3[521] = new Array('0009567801','000956780155','菲律宾首都银行')

subval3[522] = new Array('0009556801','000955680128','曹杨支行')

subval3[523] = new Array('0009556801','000955680129','延平支行')

subval3[524] = new Array('0009556801','000955680130','漕河泾支行')

subval3[525] = new Array('0009556801','000955680131','延中支行')

subval3[526] = new Array('0009556801','000955680132','东方支行')

subval3[527] = new Array('0009556801','000955680133','东门支行')

subval3[528] = new Array('0009556801','000955680134','福山支行')

subval3[529] = new Array('0009556801','000955680135','古北支行')

subval3[530] = new Array('0009556801','000955680136','华山支行')

subval3[531] = new Array('0009556801','000955680137','吴中支行')

subval3[532] = new Array('0009556801','000955680138','京门支行')

subval3[533] = new Array('0009556801','000955680139','浦江支行')

subval3[534] = new Array('0009556801','000955680140','汽车城支行')

subval3[535] = new Array('0009556801','000955680141','世纪公园支行')

subval3[536] = new Array('0009556801','000955680142','市北支行')

subval3[537] = new Array('0009556801','000955680143','市东支行')

subval3[538] = new Array('0009556801','000955680144','市中支行')

subval3[539] = new Array('0009556801','000955680145','天钥支行')

subval3[540] = new Array('0009567801','000956780156','浦西支行')

subval3[541] = new Array('0009567801','000956780157','北欧银行瑞典有限公司')

subval3[542] = new Array('0009567801','000956780158','比利时联合银行')

subval3[543] = new Array('0009567801','000956780159','中国银行（香港）')

subval3[544] = new Array('0009567801','000956780160','印度卡纳拉银行')

subval3[545] = new Array('0009567801','000956780161','印度国家银行')

subval3[546] = new Array('0009558801','000955880121','分行营业部')

subval3[547] = new Array('0009558801','000955880122','外滩支行')

subval3[548] = new Array('0009558801','000955880123','第一支行')

subval3[549] = new Array('0009558801','000955880124','北区支行')

subval3[550] = new Array('0009558801','000955880125','虹桥开发区支行')

subval3[551] = new Array('0009550801','000955080122','外滩支行')

subval3[552] = new Array('0009550801','000955080123','淮海支行')

subval3[553] = new Array('0009557701','000955770121','市西支行')

subval3[554] = new Array('0009557701','000955770122','分行营业部')

subval3[555] = new Array('0009557701','000955770123','陆家嘴支行')

subval3[556] = new Array('0009568101','000956810102','松江支行')

subval3[557] = new Array('0009568101','000956810103','徐汇支行')

subval3[558] = new Array('0096299901','009629990122','其他')

subval3[559] = new Array('0009567801','000956780162','韩国产业银行')

subval3[560] = new Array('0009555801','000955580134','古北支行')

subval3[561] = new Array('0009555801','000955580135','北外滩支行')

subval3[562] = new Array('0009555801','000955580136','外高桥支行')

subval3[563] = new Array('0009558801','000955880126','漕河泾区支行')

subval3[564] = new Array('0001118501','000111850121','邮政公司浦东支局')

subval3[565] = new Array('0009660101','000966010101','上海支行')

subval3[566] = new Array('0009660201','000966020101','上海支行')

subval3[567] = new Array('0009660301','000966030101','上海支行')

subval3[568] = new Array('0009660401','000966040101','上海支行')

subval3[569] = new Array('0009660501','000966050101','上海支行')

subval3[570] = new Array('0009660601','000966060101','上海支行')

subval3[571] = new Array('0009660701','000966070101','上海支行')

subval3[572] = new Array('0009660801','000966080101','上海支行')

subval3[573] = new Array('0009660901','000966090101','上海支行')

subval3[574] = new Array('0009661001','000966100101','上海支行')

subval3[575] = new Array('0009661101','000966110101','上海支行')

subval3[576] = new Array('0009661201','000966120101','上海支行')

subval3[577] = new Array('0009661301','000966130101','上海支行')

subval3[578] = new Array('0009661501','000966150101','上海支行')

subval3[579] = new Array('0009661601','000966160101','上海支行')

subval3[580] = new Array('0009661701','000966170101','上海支行')

subval3[581] = new Array('0009661801','000966180101','上海支行')

subval3[582] = new Array('0009661901','000966190101','上海支行')

subval3[583] = new Array('0009662001','000966200101','上海支行')

subval3[584] = new Array('0009662101','000966210101','上海支行')

subval3[585] = new Array('0009662201','000966220101','上海支行')

subval3[586] = new Array('0009662301','000966230101','上海支行')

subval3[587] = new Array('0009662401','000966240101','上海支行')

subval3[588] = new Array('0009662501','000966250101','上海支行')

subval3[589] = new Array('0009662601','000966260101','上海支行')

subval3[590] = new Array('0009662701','000966270101','上海支行')

subval3[591] = new Array('0009662801','000966280101','上海支行')

subval3[592] = new Array('0009662901','000966290101','上海支行')

subval3[593] = new Array('0009663001','000966300101','上海支行')

subval3[594] = new Array('0009663101','000966310101','上海支行')

subval3[595] = new Array('0009663201','000966320101','上海支行')

subval3[596] = new Array('0009663301','000966330101','上海支行')

subval3[597] = new Array('0009663401','000966340101','上海支行')

subval3[598] = new Array('0009663501','000966350101','上海支行')

subval3[599] = new Array('0009663601','000966360101','上海支行')

subval3[600] = new Array('0009663701','000966370101','上海支行')

subval3[601] = new Array('0009663801','000966380101','上海支行')

subval3[602] = new Array('0009663901','000966390101','上海支行')

subval3[603] = new Array('0009664001','000966400101','上海支行')

subval3[604] = new Array('0009664101','000966410101','上海支行')

subval3[605] = new Array('0009552801','000955280128','其他')

subval3[606] = new Array('0009664201','000966420101','上海支行')

subval3[607] = new Array('0009664301','000966430101','上海支行')

subval3[608] = new Array('0009664401','000966440101','上海支行')

subval3[609] = new Array('0009568101','000956810104','浦东支行')

subval3[610] = new Array('0009664501','000966450101','上海支行')

subval3[611] = new Array('0009664601','000966460101','上海支行')

subval3[612] = new Array('0009664701','000966470101','上海支行')

subval3[613] = new Array('0009664801','000966480101','上海支行')

subval3[614] = new Array('0009664901','000966490101','上海支行')

subval3[615] = new Array('0009665001','000966500101','上海支行')

subval3[616] = new Array('0096299901','009629990102','长宁支行')

subval3[617] = new Array('0096299901','009629990103','崇明支行')

subval3[618] = new Array('0096299901','009629990104','奉贤支行')

subval3[619] = new Array('0096299901','009629990105','虹口支行')

subval3[620] = new Array('0096299901','009629990106','黄浦支行')

subval3[621] = new Array('0096299901','009629990107','嘉定支行')

subval3[622] = new Array('0096299901','009629990108','金山支行')

subval3[623] = new Array('0096299901','009629990109','静安支行')

subval3[624] = new Array('0096299901','009629990110','卢湾支行')

subval3[625] = new Array('0096299901','009629990111','闵行支行')

subval3[626] = new Array('0096299901','009629990112','南汇支行')

subval3[627] = new Array('0096299901','009629990113','浦东分行')

subval3[628] = new Array('0096299901','009629990114','普陀支行')

subval3[629] = new Array('0096299901','009629990115','青浦支行')

subval3[630] = new Array('0096299901','009629990116','松江支行')

subval3[631] = new Array('0096299901','009629990117','徐汇支行')

subval3[632] = new Array('0096299901','009629990118','杨浦支行')

subval3[633] = new Array('0096299901','009629990119','闸北支行')

subval3[634] = new Array('0096288801','009628880101','宝山支行')

subval3[635] = new Array('0096288801','009628880102','长宁支行')

subval3[636] = new Array('0096288801','009628880103','现金中心')

subval3[637] = new Array('0096288801','009628880104','奉贤支行')

subval3[638] = new Array('0096288801','009628880105','虹口支行')

subval3[639] = new Array('0096288801','009628880106','黄浦支行')

subval3[640] = new Array('0096288801','009628880107','嘉定支行')

subval3[641] = new Array('0096288801','009628880108','金山支行')

subval3[642] = new Array('0096288801','009628880109','静安支行')

subval3[643] = new Array('0096288801','009628880110','卢湾支行')

subval3[644] = new Array('0096288801','009628880111','闵行支行')

subval3[645] = new Array('0096288801','009628880112','南汇支行')

subval3[646] = new Array('0096288801','009628880113','浦东分行')

subval3[647] = new Array('0096288801','009628880114','普陀支行')

subval3[648] = new Array('0096288801','009628880115','青浦支行')

subval3[649] = new Array('0096288801','009628880116','松江支行')

subval3[650] = new Array('0096288801','009628880117','徐汇支行')

subval3[651] = new Array('0096288801','009628880118','杨浦支行')

subval3[652] = new Array('0096288801','009628880119','闸北支行')

subval3[653] = new Array('0009568601','000956860101','分行营业部')

subval3[654] = new Array('0001118501','000111850122','邮政公司南汇支局')

subval3[655] = new Array('0001118501','000111850123','邮政公司奉贤支局')

subval3[656] = new Array('0001118501','000111850124','邮政公司松江支局')

subval3[657] = new Array('0001118501','000111850125','邮政公司金山支局')

subval3[658] = new Array('0009665101','000966510101','上海支行')

subval3[659] = new Array('0009665201','000966520101','上海支行')

subval3[660] = new Array('0009568101','000956810105','闵行支行')

subval3[661] = new Array('0009556101','000955610121','陆家嘴支行')

subval3[662] = new Array('0009556101','000955610122','漕河泾支行')

subval3[663] = new Array('0009550101','000955010123','市中支行')

subval3[664] = new Array('0009550101','000955010124','淮海支行')

subval3[665] = new Array('0009568701','000956870101','上海支行')

subval3[666] = new Array('0009568801','000956880101','上海支行')

subval3[667] = new Array('0009557701','000955770124','大柏树支行')

subval3[668] = new Array('0001118501','000111850126','邮政公司青浦支局')

subval3[669] = new Array('0001118501','000111850127','邮政公司宝山支局')

subval3[670] = new Array('0001118501','000111850128','邮政公司川沙支局')

subval3[671] = new Array('0009558801','000955880127','第二营业部')

subval3[672] = new Array('0009556101','000955610123','分行营业部')

subval3[673] = new Array('0009567901','000956790107','普陀支行')

subval3[674] = new Array('0009567901','000956790108','虹桥支行')

subval3[675] = new Array('0009567901','000956790109','虹口支行')

subval3[676] = new Array('0009568301','000956830106','徐汇支行')

subval3[677] = new Array('0009558801','000955880128','东区支行')

subval3[678] = new Array('0009558801','000955880129','西区支行')

subval3[679] = new Array('0009558801','000955880130','南区支行')

subval3[680] = new Array('0009558801','000955880131','国际机场支行')

subval3[681] = new Array('0009558801','000955880132','其他')

subval3[682] = new Array('0009559501','000955950121','南市支行')

subval3[683] = new Array('0009559501','000955950122','外滩支行')

subval3[684] = new Array('0009559501','000955950123','市西支行')

subval3[685] = new Array('0009559501','000955950124','古北支行')

subval3[686] = new Array('0009559501','000955950125','大华支行')

subval3[687] = new Array('0009559501','000955950126','昌里支行')

subval3[688] = new Array('0009559501','000955950127','常德支行')

subval3[689] = new Array('0009559501','000955950128','期交所支行')

subval3[690] = new Array('0009559501','000955950129','长兴岛支行')

subval3[691] = new Array('0009559501','000955950130','江宁支行')

subval3[692] = new Array('0009559501','000955950131','联洋支行')

subval3[693] = new Array('0009559501','000955950132','龙茗支行')

subval3[694] = new Array('0009559501','000955950133','外高桥支行')

subval3[695] = new Array('0009559501','000955950134','浦东二支行')

subval3[696] = new Array('0009559501','000955950135','市东支行')

subval3[697] = new Array('0009559501','000955950136','漕河泾支行')

subval3[698] = new Array('0009559501','000955950137','花木支行')

subval3[699] = new Array('0009559501','000955950138','金桥支行')

subval3[700] = new Array('0009559501','000955950139','市北支行')

subval3[701] = new Array('0009559501','000955950140','不夜城支行')

subval3[702] = new Array('0009559501','000955950141','市中支行')

subval3[703] = new Array('0009559501','000955950142','市南支行')

subval3[704] = new Array('0009559501','000955950143','北外滩支行')

subval3[705] = new Array('0009556101','000955610124','人民广场支行')

subval3[706] = new Array('0009556101','000955610125','市南支行')

subval3[707] = new Array('0009556101','000955610126','市中支行')

subval3[708] = new Array('0009556101','000955610127','七宝支行')

subval3[709] = new Array('0009556101','000955610128','市西支行')

subval3[710] = new Array('0009556101','000955610129','南外滩支行')

subval3[711] = new Array('0009556101','000955610130','淮海支行')

subval3[712] = new Array('0009556101','000955610131','虹桥支行')

subval3[713] = new Array('0009556101','000955610132','金沙江支行')

subval3[714] = new Array('0009556101','000955610133','大柏树支行')

subval3[715] = new Array('0009556101','000955610134','市北支行')

subval3[716] = new Array('0009550101','000955010125','虹桥支行')

subval3[717] = new Array('0009550101','000955010126','安亭支行')

subval3[718] = new Array('0009550101','000955010127','五角场支行')

subval3[719] = new Array('0009550101','000955010128','市南支行')

subval3[720] = new Array('0009550101','000955010129','北京西路支行')

subval3[721] = new Array('0009568001','000956800102','宝山支行')

subval3[722] = new Array('0009568001','000956800103','浦东支行')

subval3[723] = new Array('0009568001','000956800104','闵行支行')

subval3[724] = new Array('0009568001','000956800105','嘉定支行')

subval3[725] = new Array('0009568001','000956800106','长宁支行')

subval3[726] = new Array('0009568001','000956800107','松江支行')

subval3[727] = new Array('0009568001','000956800108','普陀支行')

subval3[728] = new Array('0009568001','000956800109','南汇支行')

subval3[729] = new Array('0009568001','000956800110','其他')

subval3[730] = new Array('0009568501','000956850102','普陀支行')

subval3[731] = new Array('0009568501','000956850103','杨浦支行')

subval3[732] = new Array('0009568501','000956850104','南汇支行')

subval3[733] = new Array('0009568501','000956850105','其他')

subval3[734] = new Array('0009568301','000956830107','其他')

subval3[735] = new Array('0009568201','000956820102','闵行支行')

subval3[736] = new Array('0009568201','000956820103','陆家嘴支行')

subval3[737] = new Array('0009568201','000956820104','嘉定支行')

subval3[738] = new Array('0009568201','000956820105','长宁支行')

subval3[739] = new Array('0009568401','000956840102','杨浦支行')

subval3[740] = new Array('0009568401','000956840103','浦东支行')

subval3[741] = new Array('0009568401','000956840104','闵行支行')

subval3[742] = new Array('0009568401','000956840105','徐汇支行')

subval3[743] = new Array('0009568401','000956840106','虹口支行')

subval3[744] = new Array('0009568401','000956840107','嘉定支行')

subval3[745] = new Array('0009568101','000956810106','静安支行')

subval3[746] = new Array('0009568101','000956810107','其他')

subval3[747] = new Array('0009568601','000956860102','其他')

subval3[748] = new Array('0009568801','000956880102','其他')

subval3[749] = new Array('0009568701','000956870102','其他')

subval3[750] = new Array('0001118501','000111850129','邮政公司崇明支局')

subval3[751] = new Array('0001118501','000111850130','邮政公司其他支局')

subval3[752] = new Array('0009665301','000966530101','上海支行')

subval3[753] = new Array('0096288801','009628880126','崇明支行')

subval3[754] = new Array('0009665401','000966540101','上海支行')

subval3[755] = new Array('0009568901','000956890101','上海支行')

subval3[756] = new Array('0009550101','000955010130','分行营业部')

subval3[757] = new Array('0009568201','000956820106','其他')

subval3[758] = new Array('0009568401','000956840108','其他')

subval3[759] = new Array('0009558801','000955880133','张江支行')

subval3[760] = new Array('0009558801','000955880134','临港支行')

subval3[761] = new Array('0009550801','000955080124','奉贤支行')

subval3[762] = new Array('0009557701','000955770125','张江支行')

subval3[763] = new Array('0009557701','000955770126','青浦支行')

subval3[764] = new Array('0009555501','000955550158','黄浦支行')

subval3[765] = new Array('0009660101','000966010102','杨浦支行')

subval3[766] = new Array('0009569001','000956900101','上海支行')

subval3[767] = new Array('0009569101','000956910101','上海支行')

subval3[768] = new Array('0009569201','000956920101','上海支行')

subval3[769] = new Array('0009568801','000956880103','闵行支行')

subval3[770] = new Array('0009569301','000956930101','崇明支行')

subval3[771] = new Array('0009569401','000956940101','闵行支行')

subval3[772] = new Array('0009569501','000956950101','奉贤支行')

subval3[773] = new Array('0009555801','000955580137','南京东路支行')

subval3[774] = new Array('0096299901','009629990123','惠南支行')

subval3[775] = new Array('0009568601','000956860103','静安支行')

subval3[776] = new Array('0009568601','000956860104','闵行支行')

subval3[777] = new Array('0009568401','000956840109','长宁支行')

subval3[778] = new Array('0009660301','000966030102','虹桥支行')

subval3[779] = new Array('0009660301','000966030103','徐汇支行')

subval3[780] = new Array('0009660301','000966030104','静安支行')

subval3[781] = new Array('0009660301','000966030105','松江支行')

subval3[782] = new Array('0009660301','000966030106','新天地支行')

subval3[783] = new Array('0009556801','000955680146','现金处理中心')

subval3[784] = new Array('0009556801','000955680147','零售银行运营保障部')

subval3[785] = new Array('0009556801','000955680148','七宝支行')

subval3[786] = new Array('0009556801','000955680149','花木支行')

subval3[787] = new Array('0009556801','000955680150','九亭支行')

subval3[788] = new Array('0009556801','000955680151','曹安支行')

subval3[789] = new Array('0009556801','000955680152','凯旋支行')

subval3[790] = new Array('0009556801','000955680153','奉贤支行')

subval3[791] = new Array('0009556801','000955680154','嘉定村镇')

subval3[792] = new Array('0009661701','000966170102','新天地支行')

subval3[793] = new Array('0009661701','000966170103','虹桥支行')

subval3[794] = new Array('0009661701','000966170104','外滩支行')

subval3[795] = new Array('0009661701','000966170105','普陀支行')

subval3[796] = new Array('0009661701','000966170106','松江支行')

subval3[797] = new Array('0009661701','000966170107','黄浦支行')

subval3[798] = new Array('0009661701','000966170108','虹口支行')

subval3[799] = new Array('0009661701','000966170109','徐家汇支行')

subval3[800] = new Array('0009661701','000966170110','普陀支行')

subval3[801] = new Array('0009665401','000966540102','汇亚支行')

subval3[802] = new Array('0009665401','000966540103','港汇支行')

subval3[803] = new Array('0009665401','000966540104','古北支行')

subval3[804] = new Array('0009665401','000966540105','分行运营部')

subval3[805] = new Array('0009665401','000966540106','浦西支行')

subval3[806] = new Array('0009665401','000966540107','新世界支行')

subval3[807] = new Array('0009661101','000966110102','东方路支行')

subval3[808] = new Array('0009661101','000966110103','徐家汇支行')

subval3[809] = new Array('0009661101','000966110104','虹桥支行')

subval3[810] = new Array('0009661101','000966110105','长宁支行')

subval3[811] = new Array('0009661101','000966110106','联洋支行')

subval3[812] = new Array('0009661101','000966110107','新天地支行')

subval3[813] = new Array('0009661101','000966110108','分行营业部')

subval3[814] = new Array('0009661101','000966110109','浦西支行')

subval3[815] = new Array('0009661101','000966110110','陆家嘴支行')

subval3[816] = new Array('0009661101','000966110111','静安支行')

subval3[817] = new Array('0009662401','000966240102','卢湾支行')

subval3[818] = new Array('0009662401','000966240103','嘉定支行')

subval3[819] = new Array('0009663101','000966310102','徐汇支行')

subval3[820] = new Array('0009663101','000966310103','虹桥支行')

subval3[821] = new Array('0009663101','000966310104','陆家嘴支行')

subval3[822] = new Array('0009556101','000955610135','龙柏支行')

subval3[823] = new Array('0009556101','000955610136','五角场支行')

subval3[824] = new Array('0009663401','000966340102','浦西支行')

subval3[825] = new Array('0009663401','000966340103','吴中路支行')

subval3[826] = new Array('0009660501','000966050102','中山公园支行')

subval3[827] = new Array('0009660501','000966050103','静安支行')

subval3[828] = new Array('0009660501','000966050104','新天地支行')

subval3[829] = new Array('0009660501','000966050105','古北支行')

subval3[830] = new Array('0009556801','000955680155','南汇支行')

subval3[831] = new Array('0009555901','000955590120','金山支行')

subval3[832] = new Array('0009661201','000966120102','虹桥支行')

subval3[833] = new Array('0096288801','009628880127','金桥支行')

subval3[834] = new Array('0009664801','000966480102','新天地支行')

subval3[835] = new Array('0009661701','000966170111','分行营业部')

subval3[836] = new Array('0009552801','000955280129','南市支行')

subval3[837] = new Array('0009568701','000956870103','分行营业部')

subval3[838] = new Array('0009568201','000956820107','徐汇支行')

subval3[839] = new Array('0009568201','000956820108','松江支行')

subval3[840] = new Array('0009660501','000966050106','浦西支行')

subval3[841] = new Array('0009661501','000966150102','浦西支行')

subval3[842] = new Array('0009661501','000966150103','虹口支行')

subval3[843] = new Array('0009661501','000966150104','中山公园支行')

subval3[844] = new Array('0009661501','000966150105','陆家嘴支行')

subval3[845] = new Array('0009661501','000966150106','亚龙广场支行')

subval3[846] = new Array('0009661501','000966150107','新天地支行')

subval3[847] = new Array('0009661501','000966150108','徐家汇支行')

subval3[848] = new Array('0009661501','000966150109','古北支行')

subval3[849] = new Array('0009661501','000966150110','嘉定支行')

subval3[850] = new Array('0009661501','000966150111','卢湾支行')

subval3[851] = new Array('0009661501','000966150112','人民广场站支行')

subval3[852] = new Array('0009660901','000966090102','徐家汇支行')

subval3[853] = new Array('0009660901','000966090103','虹口支行')

subval3[854] = new Array('0009660901','000966090104','长宁支行')

subval3[855] = new Array('0009663401','000966340104','锦绣江南支行')

subval3[856] = new Array('0009569001','000956900102','分行营业部')

subval3[857] = new Array('0009663501','000966350102','浦东支行')

subval3[858] = new Array('0009662401','000966240104','东方路支行')

subval3[859] = new Array('0009568501','000956850106','松江支行')

subval3[860] = new Array('0009569101','000956910102','分行营业部')

subval3[861] = new Array('0096288801','009628880128','张江支行')

subval3[862] = new Array('0096288801','009628880129','锦绣路支行')

subval3[863] = new Array('0009568901','000956890102','分行营业部')

subval3[864] = new Array('0009556101','000955610137','广场支行')

subval3[865] = new Array('0009556101','000955610138','沪闵支行')

subval3[866] = new Array('0009660501','000966050107','城建国际中心支行')

subval3[867] = new Array('0009552801','000955280130','张江支行')

subval3[868] = new Array('0009556601','000955660123','出纳管理部')

subval3[869] = new Array('0009556101','000955610139','彭浦支行')

subval3[870] = new Array('0009556101','000955610140','交易所支行')

subval3[871] = new Array('0009556101','000955610141','天山支行')

subval3[872] = new Array('0009661401','000966140101','上海支行')

subval3[873] = new Array('0009569601','000956960101','分行营业部')

subval3[874] = new Array('0009555501','000955550159','浦东支行')

subval3[875] = new Array('0009557701','000955770127','松江支行')

subval3[876] = new Array('0009665501','000966550101','上海支行')

subval3[877] = new Array('0009557701','000955770128','现金中心')

subval3[878] = new Array('0009569701','000956970101','营业部')

subval3[879] = new Array('0001118501','000111850131','邮储银行分行营业部')

subval3[880] = new Array('0001118501','000111850132','邮政公司代理业务局')

subval3[881] = new Array('0009568001','000956800111','徐汇支行')

subval3[882] = new Array('0009660901','000966090105','卢湾支行')

subval3[883] = new Array('0009555901','000955590121','黄浦支行')

subval3[884] = new Array('0009567901','000956790110','松江支行')

subval3[885] = new Array('0009568401','000956840110','青浦支行')

subval3[886] = new Array('0009559501','000955950144','奉贤支行')

subval3[887] = new Array('0009555901','000955590122','崇明支行')

subval3[888] = new Array('0009568501','000956850107','金桥支行')

subval3[889] = new Array('0009568101','000956810108','长宁支行')

subval3[890] = new Array('0009568201','000956820109','普陀支行')

subval3[891] = new Array('0009568301','000956830108','普陀支行')

subval3[892] = new Array('0009568101','000956810109','嘉定支行')

subval3[893] = new Array('0009552801','000955280131','浦东支行')

subval3[894] = new Array('0009550101','000955010131','集中作业部')

subval3[895] = new Array('0009550101','000955010132','运营管理部')

subval3[896] = new Array('0009550101','000955010133','外滩支行')

subval3[897] = new Array('0009550101','000955010134','南西支行')

subval3[898] = new Array('0009550101','000955010135','周浦支行')

subval3[899] = new Array('0009550101','000955010136','花木支行')

subval3[900] = new Array('0009665601','000966560101','上海支行')

subval3[901] = new Array('0009552801','000955280132','虹桥支行')

subval3[902] = new Array('0009552801','000955280133','长风支行')

subval3[903] = new Array('0009558801','000955880135','世博支行')

subval3[904] = new Array('0009558801','000955880136','地铁支行')

subval3[905] = new Array('0009665701','000966570101','上海支行')

subval3[906] = new Array('0009556801','000955680156','大华支行')

subval3[907] = new Array('0009556801','000955680157','金桥支行')

subval3[908] = new Array('0009556801','000955680158','新泾支行')

subval3[909] = new Array('0009569801','000956980101','营业部')

subval3[910] = new Array('0009569801','000956980102','清算中心')

subval3[911] = new Array('0009569801','000956980103','新桥支行')

subval3[912] = new Array('0009569801','000956980104','泗泾支行')

subval3[913] = new Array('0009569801','000956980105','车墩支行')

subval3[914] = new Array('0009569901','000956990101','营业部')

subval3[915] = new Array('0009570001','000957000101','上海支行')

subval3[916] = new Array('0009550801','000955080125','福州路支行')

subval3[917] = new Array('0009550801','000955080126','桃浦支行')

subval3[918] = new Array('0009660901','000966090106','南京西路支行')

subval3[919] = new Array('0009661101','000966110112','古北支行')

subval3[920] = new Array('0009661501','000966150113','临汾路支行')

subval3[921] = new Array('0009660401','000966040102','联洋支行')

subval3[922] = new Array('0009660401','000966040103','商城支行')

subval3[923] = new Array('0009660401','000966040104','漕溪路支行')

subval3[924] = new Array('0009660401','000966040105','徐家汇支行')

subval3[925] = new Array('0009660401','000966040106','古北路支行')

subval3[926] = new Array('0009660401','000966040107','富豪环球东亚酒店支行')

subval3[927] = new Array('0009660401','000966040108','嘉华支行')

subval3[928] = new Array('0009660401','000966040109','香港广场支行')

subval3[929] = new Array('0009660401','000966040110','国际贵都大饭店支行')

subval3[930] = new Array('0009660401','000966040111','仙乐斯广场支行')

subval3[931] = new Array('0009660401','000966040112','嘉里城支行')

subval3[932] = new Array('0009568301','000956830109','虹口支行')

subval3[933] = new Array('0009568701','000956870104','陆家嘴支行')

subval3[934] = new Array('0009568701','000956870105','闸北支行')

subval3[935] = new Array('0009568701','000956870106','徐汇支行')

subval3[936] = new Array('0009568701','000956870107','虹口支行')

subval3[937] = new Array('0009665201','000966520102','徐汇支行')

subval3[938] = new Array('0009665201','000966520103','静安支行')

subval3[939] = new Array('0009665201','000966520104','长宁支行')

subval3[940] = new Array('0009665201','000966520105','黄浦支行')

subval3[941] = new Array('0009660901','000966090107','四川北路支行')

subval3[942] = new Array('0009663401','000966340105','城建国际中心支行')

subval3[943] = new Array('0009663401','000966340106','分行营业部')

subval3[944] = new Array('0009660501','000966050108','广通路支行')

subval3[945] = new Array('0009662401','000966240105','大宁支行')

subval3[946] = new Array('0009660801','000966080102','卢湾支行')

subval3[947] = new Array('0009660801','000966080103','嘉定支行')

subval3[948] = new Array('0009660801','000966080104','大宁支行')

subval3[949] = new Array('0009660801','000966080105','东方路支行')

subval3[950] = new Array('0009568501','000956850108','闵行支行')

subval3[951] = new Array('0009568501','000956850109','宝山支行')

subval3[952] = new Array('0009568501','000956850110','嘉定支行')

subval3[953] = new Array('0096288801','009628880130','现金中心')

subval3[954] = new Array('0096288801','009628880131','电子银行部')

subval3[955] = new Array('0009568901','000956890103','宝山支行')

subval3[956] = new Array('0009660501','000966050109','虹桥支行')

subval3[957] = new Array('0009660501','000966050110','淮海中路支行')

subval3[958] = new Array('0009556601','000955660124','弘泰支行')

subval3[959] = new Array('0009568801','000956880104','奉贤支行')

subval3[960] = new Array('0009568801','000956880105','嘉定支行')

subval3[961] = new Array('0009568801','000956880106','南汇支行')

subval3[962] = new Array('0009568801','000956880107','浦东支行')

subval3[963] = new Array('0009568801','000956880108','青浦支行')

subval3[964] = new Array('0009568801','000956880109','松江支行')

subval3[965] = new Array('0009568801','000956880110','分行营业部')

subval3[966] = new Array('0009661101','000966110113','虹口支行')

subval3[967] = new Array('0009660501','000966050111','徐家汇支行')

subval3[968] = new Array('0009660901','000966090108','黄浦支行')

subval3[969] = new Array('0009568601','000956860105','松江支行')

subval3[970] = new Array('0009568501','000956850111','徐汇支行')

subval3[971] = new Array('0009555901','000955590123','世博支行')

subval3[972] = new Array('0001118501','000111850133','邮政公司虹口区邮政局')

subval3[973] = new Array('0001118501','000111850134','邮政公司黄浦区邮政局')

subval3[974] = new Array('0001118501','000111850135','邮政公司普陀区邮政局')

subval3[975] = new Array('0001118501','000111850136','邮政公司徐汇区邮政局')

subval3[976] = new Array('0001118501','000111850137','邮政公司杨浦区邮政局')

subval3[977] = new Array('0001118501','000111850138','邮政公司闸北区邮政局')

subval3[978] = new Array('0001118501','000111850139','邮政公司其他')

subval3[979] = new Array('0001118501','000111850140','邮储银行虹口区支行')

subval3[980] = new Array('0001118501','000111850141','邮储银行黄浦区支行')

subval3[981] = new Array('0001118501','000111850142','邮储银行普陀区支行')

subval3[982] = new Array('0001118501','000111850143','邮储银行杨浦区支行')

subval3[983] = new Array('0001118501','000111850144','邮储银行长宁区支行')

subval3[984] = new Array('0001118501','000111850145','邮储银行分行营业部')

subval3[985] = new Array('0001118501','000111850146','邮储银行分行其他')

subval3[986] = new Array('0009569601','000956960102','奉贤支行')

subval3[987] = new Array('0009557701','000955770129','漕河泾支行')

subval3[988] = new Array('0009550801','000955080127','长寿路支行')

subval3[989] = new Array('0009550801','000955080128','五角场支行')

subval3[990] = new Array('0009570101','000957010101','上海支行')

subval3[991] = new Array('0009665801','000966580101','上海支行')

subval3[992] = new Array('0009665901','000966590101','上海支行')

subval3[993] = new Array('0009570201','000957020101','上海支行')

subval3[994] = new Array('0009568001','000956800112','奉贤支行')

subval3[995] = new Array('0009661501','000966150114','南京西路支行')

subval3[996] = new Array('0009660401','000966040113','恒丰路支行')

subval3[997] = new Array('0009660401','000966040114','嘉麒大厦支行')

subval3[998] = new Array('0009660401','000966040115','泰康路支行')

subval3[999] = new Array('0009568501','000956850112','奉贤支行')

subval3[1000] = new Array('0009568301','000956830110','静安支行')

subval3[1001] = new Array('0009567901','000956790111','安亭支行')

subval3[1002] = new Array('0009567901','000956790112','宝山支行')

subval3[1003] = new Array('0009550101','000955010137','金山支行')

subval3[1004] = new Array('0009550101','000955010138','市东支行')

subval3[1005] = new Array('0009550101','000955010139','张江支行')

subval3[1006] = new Array('0009660901','000966090109','张杨路支行')

subval3[1007] = new Array('0009568201','000956820110','闸北支行')

subval3[1008] = new Array('0009568601','000956860106','同济支行')

subval3[1009] = new Array('0009661501','000966150115','延安西路支行')

subval3[1010] = new Array('0009568101','000956810110','黄浦支行')

subval3[1011] = new Array('0009568101','000956810111','普陀支行')

subval3[1012] = new Array('0009568801','000956880111','杨浦支行')

subval3[1013] = new Array('0009568901','000956890104','浦东支行')

subval3[1014] = new Array('0009568901','000956890105','徐汇支行')

subval3[1015] = new Array('0009568901','000956890106','虹莘支行')

subval3[1016] = new Array('0009550101','000955010140','上海支行')

subval3[1017] = new Array('0009550101','000955010141','西南支行')

subval3[1018] = new Array('0009552801','000955280134','新华支行')

subval3[1019] = new Array('0096288801','009628880132','周浦支行')

subval3[1020] = new Array('0009660901','000966090110','古北支行')

subval3[1021] = new Array('0009568801','000956880112','宝山支行')

subval3[1022] = new Array('0009568801','000956880113','曹安支行')

subval3[1023] = new Array('0009570301','000957030101','上海支行')

subval3[1024] = new Array('0009570301','000957030102','营业部')

subval3[1025] = new Array('0009550101','000955010142','常德路支行')

subval3[1026] = new Array('0009550101','000955010143','常熟路支行')

subval3[1027] = new Array('0009550101','000955010144','九江路支行')

subval3[1028] = new Array('0009556101','000955610142','金桥支行')

subval3[1029] = new Array('0009556101','000955610143','张江支行')

subval3[1030] = new Array('0009666001','000966600101','上海支行')

subval3[1031] = new Array('0009666101','000966610101','上海支行')

subval3[1032] = new Array('0009550801','000955080129','大宁支行')

subval3[1033] = new Array('0009550801','000955080130','漕河泾支行')

subval3[1034] = new Array('0009568001','000956800113','青浦支行')

subval3[1035] = new Array('0009568001','000956800114','杨浦支行')

subval3[1036] = new Array('0009569601','000956960103','闸北支行')

subval3[1037] = new Array('0009569001','000956900103','青浦支行')

subval3[1038] = new Array('0009569001','000956900104','闸北支行')

subval3[1039] = new Array('0009559501','000955950145','周浦支行')

subval3[1040] = new Array('0009569901','000956990102','江桥支行')

subval3[1041] = new Array('0009569901','000956990103','安亭支行')

subval3[1042] = new Array('0009568501','000956850113','黄浦支行')

subval3[1043] = new Array('0009568501','000956850114','闸北支行')

subval3[1044] = new Array('0009556801','000955680159','渠道与服务部')

subval3[1045] = new Array('0009568301','000956830111','张江支行')

subval3[1046] = new Array('0009663101','000966310105','闸北支行')

subval3[1047] = new Array('0009663101','000966310106','黄浦支行')

subval3[1048] = new Array('0009570401','000957040101','上海支行')

subval3[1049] = new Array('0009569201','000956920102','分行营业部')

subval3[1050] = new Array('0009569201','000956920103','普陀支行')

subval3[1051] = new Array('0009569801','000956980106','九亭支行')

subval3[1052] = new Array('0009569801','000956980107','清算中心')

subval3[1053] = new Array('0009568801','000956880114','川沙支行')

subval3[1054] = new Array('0009568901','000956890107','嘉定支行')

subval3[1055] = new Array('0009660901','000966090111','莘庄支行')

subval3[1056] = new Array('0009660501','000966050112','闵行支行')

subval3[1057] = new Array('0009660501','000966050113','浦东分行')

subval3[1058] = new Array('0009570501','000957050101','崇明支行')

subval3[1059] = new Array('0009556801','000955680160','分行处理中心')

subval3[1060] = new Array('0009556801','000955680161','武宁支行')

subval3[1061] = new Array('0009556801','000955680162','逸仙支行')

subval3[1062] = new Array('0009556801','000955680163','金山支行')

subval3[1063] = new Array('0009556801','000955680164','同福支行')

subval3[1064] = new Array('0009556801','000955680165','泗泾支行')

subval3[1065] = new Array('0009556801','000955680166','九星支行')

subval3[1066] = new Array('0009556801','000955680167','检查辅导科')

subval3[1067] = new Array('0009556801','000955680168','清算中心')

subval3[1068] = new Array('0009556801','000955680169','新桥支行')

subval3[1069] = new Array('0009556801','000955680170','直属营业部')

subval3[1070] = new Array('0009556801','000955680171','江桥支行')

subval3[1071] = new Array('0009556801','000955680172','安亭支行')

subval3[1072] = new Array('0009556801','000955680173','分行处理中心')

subval3[1073] = new Array('0009556801','000955680174','车墩支行')

subval3[1074] = new Array('0096299901','009629990124','高东支行')

subval3[1075] = new Array('0009662601','000966260102','虹泉支行')

subval3[1076] = new Array('0009588801','000958880121','上海分行')

subval3[1077] = new Array('0009550801','000955080131','国金中心支行')

subval3[1078] = new Array('0009570601','000957060101','崇明支行')

subval3[1079] = new Array('0009550101','000955010145','曹安路支行')

subval3[1080] = new Array('0009550101','000955010146','大宁支行')

subval3[1081] = new Array('0009550101','000955010147','古北支行')

subval3[1082] = new Array('0009550101','000955010148','浦南支行')

subval3[1083] = new Array('0009550101','000955010149','四川北路支行')

subval3[1084] = new Array('0009550101','000955010150','松江支行')

subval3[1085] = new Array('0009550101','000955010151','闸北支行')

subval3[1086] = new Array('0009569201','000956920104','松江支行')

subval3[1087] = new Array('0009568801','000956880115','闸北支行')

subval3[1088] = new Array('0009568801','000956880116','徐汇支行')

subval3[1089] = new Array('0009568701','000956870108','卢湾支行')

subval3[1090] = new Array('0009556101','000955610144','银华金融')

subval3[1091] = new Array('0096299901','009629990125','现金中心')

subval3[1092] = new Array('0009550101','000955010152','延东支行')

subval3[1093] = new Array('0009550101','000955010153','新天地支行')

subval3[1094] = new Array('0009550101','000955010154','徐家汇支行')

subval3[1095] = new Array('0009568601','000956860107','徐汇支行')

subval3[1096] = new Array('0009569001','000956900105','松江支行')

subval3[1097] = new Array('0009569001','000956900106','静安支行')

subval3[1098] = new Array('0009661501','000966150116','闸北支行')

subval3[1099] = new Array('0009666201','000966620101','上海支行')

subval3[1100] = new Array('0009555901','000955590124','卢湾支行')

subval3[1101] = new Array('0009552801','000955280135','川沙支行')

subval3[1102] = new Array('0009555901','000955590125','自贸区分行')

subval3[1103] = new Array('0009559901','000955990124','上海银华金融')

subval3[1104] = new Array('0009666301','000966630101','上海支行')

subval3[1105] = new Array('0009568001','000956800115','虹口支行')

subval3[1106] = new Array('0009660701','000966070102','静安支行')

subval3[1107] = new Array('0009660701','000966070103','新天地支行')

subval3[1108] = new Array('0009661101','000966110114','自贸试验区支行')

subval3[1109] = new Array('0009559501','000955950146','华新支行')

subval3[1110] = new Array('0009661501','000966150117','花旗大厦支行')

subval3[1111] = new Array('0009660301','000966030107','青浦支行')

subval3[1112] = new Array('0009660301','000966030108','分行营业部')

subval3[1113] = new Array('0009660401','000966040116','安福路支行')

subval3[1114] = new Array('0009660401','000966040117','碧云支行')

subval3[1115] = new Array('0009660401','000966040118','虹桥支行')

subval3[1116] = new Array('0009660401','000966040119','创智天地支行')

subval3[1117] = new Array('0009660401','000966040120','自贸区支行')

subval3[1118] = new Array('0009569101','000956910103','奉贤支行')

subval3[1119] = new Array('0009568301','000956830112','嘉定支行')

subval3[1120] = new Array('0009568101','000956810112','卢湾支行')

subval3[1121] = new Array('0009568101','000956810113','张江支行')

subval3[1122] = new Array('0009666401','000966640101','上海支行')

subval3[1123] = new Array('0009569201','000956920105','浦东支行')

subval3[1124] = new Array('0009568801','000956880117','黄浦支行')

subval3[1125] = new Array('0009568801','000956880118','金山支行')

subval3[1126] = new Array('0009568901','000956890108','杨浦支行')

subval3[1127] = new Array('0009660901','000966090112','浦东支行')

subval3[1128] = new Array('0009556601','000955660125','自贸区分行')

subval3[1129] = new Array('0096288801','009628880133','自贸区分行')

subval3[1130] = new Array('0009556601','000955660126','个人金融部')

subval3[1131] = new Array('0009569001','000956900107','浦东支行')

subval3[1132] = new Array('0009556101','000955610144','东区支行')

subval3[1133] = new Array('0009568301','000956830113','黄浦支行')

subval3[1134] = new Array('0009553301','000955330123','自贸区分行')

subval3[1135] = new Array('0009570701','000957070101','上海支行')

subval3[1136] = new Array('0009552801','000955280136','自贸区分行')

subval3[1137] = new Array('0009553301','000955330124','第一支行')

subval3[1138] = new Array('0009550101','000955010155','自贸区分行')

subval3[1139] = new Array('0009550101','000955010156','大柏树支行')

subval3[1140] = new Array('0009550101','000955010157','七宝支行')

subval3[1141] = new Array('0009550101','000955010158','金沙江支行')

subval3[1142] = new Array('0009550101','000955010159','长风支行')

subval3[1143] = new Array('0009556801','000955680175','春申支行')

subval3[1144] = new Array('0009556801','000955680176','自贸试验区分行')

subval3[1145] = new Array('0009569901','000956990104','真新支行')

subval3[1146] = new Array('0009556801','000955680177','合荣欣业')

subval3[1147] = new Array('0009556801','000955680178','广灵支行')

subval3[1148] = new Array('0009556801','000955680179','豫园支行')

subval3[1149] = new Array('0009556801','000955680180','中原支行')

subval3[1150] = new Array('0009559901','000955990125','杨浦支行')

subval3[1151] = new Array('0009555801','000955580138','大柏树支行')

subval3[1152] = new Array('0009555801','000955580139','富丽支行')

subval3[1153] = new Array('0009555801','000955580140','人民广场支行')

subval3[1154] = new Array('0009555801','000955580141','市南支行')

subval3[1155] = new Array('0009555801','000955580142','营运部')

subval3[1156] = new Array('0009555801','000955580143','中山公园支行')

subval3[1157] = new Array('0009559901','000955990126','自贸试验区分行')

subval3[1158] = new Array('0009553301','000955330125','大客户一部')

subval3[1159] = new Array('0009568801','000956880119','南翔支行')

subval3[1160] = new Array('0009568801','000956880120','普陀支行')

subval3[1161] = new Array('0009557701','000955770130','四平支行')

subval3[1162] = new Array('0009570801','000957080101','分行营业部')

subval3[1163] = new Array('0009568801','000956880121','高行支行')

subval3[1164] = new Array('0009570901','000957090101','上海支行')

subval3[1165] = new Array('0009556101','000955610145','自贸实验区分行')

subval3[1166] = new Array('0009660301','000966030109','嘉定支行')

subval3[1167] = new Array('0009660301','000966030110','闵行支行')

subval3[1168] = new Array('0096299901','009629990126','自贸实验区分行')

subval3[1169] = new Array('0009556101','000955610146','大华支行')

subval3[1170] = new Array('0009556101','000955610147','会计结算部')

subval3[1171] = new Array('0009556101','000955610148','南翔支行')

subval3[1172] = new Array('0009555801','000955580144','自贸试验区分行')

subval3[1173] = new Array('0009555801','000955580145','打浦桥支行')

subval3[1174] = new Array('0009555801','000955580146','胶州路支行')

subval3[1175] = new Array('0009555801','000955580147','杨浦支行')

subval3[1176] = new Array('0009555801','000955580148','长风支行')

subval3[1177] = new Array('0009555801','000955580149','长寿支行')

subval3[1178] = new Array('0009555801','000955580150','周浦支行');


	$.getJSON("getBank?type=zonghang",function(json){
//	[{"id":"123a","name":"上海银行"},{"id":"B0003H111000001","name":"中国银行股份有限公司"}]
		var zonghang_html ="<option>==请选择所属总行==</option>";
		var id,name;
		for(var i=0,l=json.length;i<l;i++){  
		id = json[i]["id"];
		name = json[i]["name"];
		//<option value="00095888" >人民银行</option>
		zonghang_html += "<option value=" + id +">" + name +"</option>"; 
		     }  
		     $("#select_zonghang").html(zonghang_html);

	});

	$("#select_zonghang").change(function(){
		
		var zonghang_id = $("#select_zonghang").val()
	    <%--for (i=0; i<subval2.length; i++)--%>
	    <%--{--%>
		<%--if (subval2[i][0] == zonghang_id)--%>
			<%--myHtml += "<option value="+subval2[i][1]+">" + subval2[i][2] + "</option>";--%>
	    <%--}--%>
	    <%--$("#select_fenhang").html(myHtml);--%>
		$.getJSON("getBank?type=fenhang&zonghangid="+zonghang_id,function(json){
			var myHtml="<option>==请选择所属分行==</option>";
			var id,name;
			for(var i=0,l=json.length;i<l;i++){  
			id = json[i]["id"];
			name = json[i]["name"];
			myHtml += "<option value=" + id +">" + name +"</option>"; 
		     }  
		     $("#select_fenhang").html(myHtml);
		     });
	    

	});

	$("#select_fenhang").change(function(){
		
		var fenhang_id = $("#select_fenhang").val()
		<%--var myHtml="<option>==请选择所属支行==</option>";--%>
	    <%--for (i=0; i<subval3.length; i++)--%>
	    <%--{--%>
		<%--if (subval3[i][0] == fenhang_id)--%>
			<%--myHtml += "<option value="+subval3[i][1]+">" + subval3[i][2] + "</option>";--%>
	    <%--}--%>
	    <%--$("#select_zhihang").html(myHtml);--%>
		$.getJSON("getBank?type=zhihang&fenhangid="+fenhang_id,function(json){
			var myHtml="<option>==请选择所属支行==</option>";
			var id,name;
			for(var i=0,l=json.length;i<l;i++){  
			id = json[i]["id"];
			name = json[i]["name"];
			myHtml += "<option value=" + id +">" + name +"</option>"; 
		     }  
		     $("#select_zhihang").html(myHtml);
		     });

	});

	$("#submit").click(function(){

		return checkSubmit();
	});

	var imageOk =false;

<%--	$("#photo").change(function(){

	    imageOk = false;
	    if(checkImgType(this))
		imageOk = true;
	    //checkImgPX(this,150,210);  //判断图片大小服务器后台做 
	});
	--%>

 function checkSubmit() {
            var result = false;
            if (!$('#username').val())
                alert('请填写姓名');
            else if (new RegExp("[0-9]").test($('#username').val()))
                alert('姓名不能包含数字');
            else if (!$.trim($('#id').val()))
                alert('请填写身份证号');
	    else if (new RegExp(" /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/").test($('#id').val())) 
                alert('身份证号错误');
            else if ($('#id').val()!=$('#confirmId').val())
                alert('身份证两次填写不一致');
            <%--else if (!checkEmail($('#mail').val()))--%>
                <%--alert('请填写正确的邮箱');--%>
	    else if (!$('#password').val())
		alert('请填写密码');
            else if ($('#password').val()!=$('#confirmPassword').val())
                alert('两次密码填写不一致');
//            else if (!imageOk)    //move to uploadPhoto.jsp
 //               alert('请上传照片');
            else
                result = true;
            return result;
        }


        function checkEmail(email) {
            var reg = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;
            return reg.test(email);
        }

        function checkImgType(ths) {
            if (ths.value == "") {
                alert("请上传图片");
                return false;
            } else {
                if (!/\.(jpg|JPG)$/.test(ths.value)) {
                    alert("图片类型必须是jpg");
                    ths.value = "";
                    return false;
                }

                else {
                    while (true) {
                        if (ths.files[0].size > 50 * 1024) {
                            alert("图片不大于50KB。");
                            return false;
                        }
                        break;

                    }
                }
            }
            return true;
        }

        function checkImgPX(ths, width, height) {
            var img = null;
            img = document.createElement("img");
            document.body.insertAdjacentElement("beforeEnd", img); // firefox不行  
            img.style.visibility = "hidden";
            img.src = ths.value;
            var imgwidth = img.offsetWidth;
            var imgheight = img.offsetHeight;

            alert(imgwidth + "," + imgheight);

            if (imgwidth != width || imgheight != height) {
                alert("图的尺寸应该是" + width + "x" + height);
                ths.value = "";
                return false;
            }
            return true;
        }


})
//-->
</script>
</head>
<body style="background-image: url(images/mainbgimg.gif);">
${message }
<table width="760" border="0" align="center" cellpadding="5" cellspacing="0">
  <tbody><tr>
    <td>
	<form id="register_form" action="registerCheck" method="post">  
	<table width="760" border="0" cellspacing="0" cellpadding="3">
      <tbody><tr>
        <td width="204"><div align="right">姓名</div></td>
        <td width="556">
          <input name="username" type="text" id="username" size="5" style="">
          <font color="red">*</font>&nbsp;&nbsp;男
          <input name="sex" type="radio" value="男" checked="checked">
          女
          <input type="radio" name="sex" value="女"></td>
      </tr>
      <tr>
        <td><div align="right">身份证号</div></td>
        <td><input name="id" type="text" id="id" size="18" maxlength="18">
          <font color="red">*</font></td>
      </tr>
      <tr>
        <td><div align="right">验证身份证号</div></td>
        <td><input name="confirmId" type="text" id="confirmId" size="18" maxlength="18">
            <font color="red">*</font></td>
      </tr>
      <tr>
        <td><div align="right">密码</div></td>
        <td><input name="password" type="password" id="password" size="8" maxlength="8" style="">
          <font color="red">*</font></td>
      </tr>
      <tr>
        <td><div align="right">验证密码</div></td>
        <td><input name="confirmPassword" type="password" id="confirmPassword" size="8" maxlength="8" style="">
            <font color="red">*</font></td>
      </tr>
      <tr>
        <td><input name="kaocode" type="hidden" id="kaocode" value="151439"><div align="right">考生单位</div></td>
        <td>

<select name="zonghang" id="select_zonghang">
<option>==请选择所属总行==</option>
<option value="00095888" >人民银行</option>
</select>

<select name="fenhang" id="select_fenhang">
<option>==请选择所属分行==</option>
</select>

<select name="zhihang" id="select_zhihang">
<option>==请选择所属支行==</option>
</select>

          <font color="red">*</font></td>
      </tr>
      <tr>
        <td><div align="right">所属总行代码</div></td>
        <td><input name="bankone" type="text" id="bankone" size="8" maxlength="8">
          <font color="red">*</font><input type="button" value="查询" onclick="window.open('querybankcode.asp','总行代码查询','toolbars=no,location=no,width=820,scrollbars=yes,status=no,resizable=yes');"></td>
      </tr>
      <tr>
        <td><div align="right">分理处</div></td>
        <td><input name="fenlichu" type="text" id="fenlichu" size="30"></td>
      </tr>
      <tr>
        <td><div align="right">工号</div></td>
        <td><input name="code" type="text" id="code" value="00000000" size="8">
      </tr>
      <tr>
        <td><div align="right">手机</div></td>
        <td><input name="mobile" type="text" id="mobile" size="11" maxlength="11">
      </tr>
      <tr>
        <td><div align="right">Email</div></td>
        <td><input name="mail" type="text" id="mail" size="20"></td>
      </tr>
    <%--  <tr>
	      <td><div align="right">个人照片<font color="red">*</font></div></td>
	      <td><input type="file" Name="photo" id="photo" value="默认值" ></td>

      </tr>
      --%>
<tr>
        <td>&nbsp;</td>
        <td><input type="submit" name="submit"  id="submit" value="确认注册" >
          <input type="reset" name="submit2" value="重 置"></td>
      </tr>
    </tbody></table>
	</form>
	</td>
  </tr>
</tbody>
</form>
</table>
</body>
</html>


